Repository: oandregal/poss-gl
Catalog: tmx/ch09.tmx
Source language: en
Languages: gl

source: Licenses, Copyrights, and Patents
gl: Licenzas, dereitos de autor (copyright) e patentes

source: The license you select probably won't have a major impact on the adoption of your project, as long as the license is open source. Users generally choose software based on quality and features, not on the details of the license. Nevertheless, you still need a basic understanding of free software licensing issues, both to ensure that the project's license is compatible with its goals, and to be able to discuss licensing decisions with other people. Please note, however, that I am not a lawyer, and that nothing in this chapter should be construed as formal legal advice. For that, you'll need to hire a lawyer or be one.
gl: A licenza que escolleres probablemente non vai ter un impacto significativo na adopción do teu proxecto, sempre e cando a licenza for de software libre. Os usuarios normalmente escollen o software baseándose na calidade e nas funcionalidades, non baseándose nos detalles da licenza. Contodo, segues precisando ter un coñecemento básico relativo ao licenciamento do software libre, tanto para aseguráreste de que a licenza do proxecto é compatible cos seus obxectivos, como para estares capacitado para discutires as decisións de licenciamento co resto da xente. Por favor, ten en conta que eu non son un avogado, e que nada neste capítulo deber ser tido en conta como consellos legais. Para elo, deberás contratar un avogado, ou selo.

source: Terminology
gl: Terminoloxía

source: In any discussion of open source licensing, the first thing that becomes apparent is that there seem to be many different words for the same thing: <firstterm>free&nbsp;software</firstterm>, <firstterm>open&nbsp;source</firstterm>, <firstterm>FOSS</firstterm>, <firstterm>F/OSS</firstterm>, and <firstterm>FLOSS</firstterm>. Let's start by sorting those out, along with a few other terms.
gl: En calquera discusión sobre licenzas de software libre, o primeiro que sae á superficie é que parece haber varias palabras diferentes para falar da mesma cousa: <firstterm>software&nbsp;libre</firstterm>, <firstterm>código&nbsp;aberto</firstterm>, <firstterm>FOSS</firstterm>, <firstterm>F/OSS</firstterm>, e <firstterm>FLOSS</firstterm>. Comecemos por traballarmos estes termos, ademais de algúns outros.

source: free software
gl: Software libre (free software)

source: Software that can be freely shared and modified, including in source code form. The term was first coined by Richard Stallman, who codified it in the GNU General Public License (GPL), and who founded the Free Software Foundation (<ulink url="http://www.fsf.org/"></ulink>) to promote the concept.
gl: Software que pode ser libremente compartido e modificado, incluíndo o código fonte. O termo foi coinado por primeira vez por Richard Stallman, quen o inseriu na GNU Public License (GPL), e quen fundou a Free Software Foundation (<ulink url="http://www.fsf.org/"></ulink>) para promover o concepto.

source: Although "free software" covers almost exactly the same range of software as "open source", the FSF, among others, prefers the former term because it emphasizes the idea of freedom, and the concept of freely redistributable software as primarily a social movement rather than a technical one. The FSF acknowledges that the term is ambiguous&mdash;it could mean "free" as in "zero-cost", instead of "free" as in "freedom"&mdash;but feels that it's still the best term, all things considered, and that the other possibilities in English have their own ambiguities. (Throughout this book, "free" is used in the "freedom" sense, not the "zero-cost" sense.)
gl: Embora "software libre" cubra case exactamente o mesmo tipo de software que "software de código aberto (open source software)", a FSF (Free Software Foundation), entre outros, prefire o primeiro termo debido a que fai fincapé na idea da liberdade, así como no concepto de que o software redistribuíble de xeito libre é principalmente un movemento social máis que algo técnico. A FSF é consciente de que o termo, en inglés, é ambiguo&mdash;"free" pode significar "gratuíto", en troca de "liberdade"&mdash;mais aínda así considera que segue sendo o mellor termo, e que o resto de posibilidades, en inglés, teñen as súas ambigüidades. (Ao longo deste libro, "free"/"libre" é empregado co significado de "liberdade" e non co significado de "gratuíto").

source: open source software
gl: Software de código aberto (open source)

source: Free software under another name. But the different name reflects an important philosophical difference: "open source" was coined by the Open Source Initiative (<ulink url="http://www.opensource.org/"></ulink>) as a deliberate alternative to "free software," in order to make such software a more palatable choice for corporations, by presenting it as a development methodology rather than a political movement. They may also have wanted to overcome another stigma: that anything "free" must be low quality.
gl: Software libre baixo outro nome. Mais a diferenza de nome reflicte unha diferenza filosófica importante: o nome "software de código aberto (open source)" foi coinado pola Open Source Initiative (<ulink url="http://www.opensource.org/"></ulink>) como unha alternativa deliberada a "software libre (free software)", co fin de tornar este software máis atractivo para as corporacións, presentándoo como unha metodoloxía de desenvolvemento máis que como un movemento político. Tamén pretendían superar outro estigma: o gratuíto ten pouca calidade.

source: While any license that is free is also open source, and vice versa (with a few minor exceptions), people tend to pick one term and stick with it. In general, those who prefer "free software" are more likely to have a philosophical or moral stance on the issue, while those who prefer "open source" either don't view it as a matter of freedom, or are not interested in advertising the fact that they do. See <xref linkend="free-vs-open-source"/><phrase output="printed"> in <xref linkend="introduction"/></phrase> for a more detailed history of this schism.
gl: Aínda que calquera licenza que sexa libre tamén o é de fontes abertas, e viceversa (cunhas poucas excepcións), a xente tende a escoller un termo e aferrarse a el. En xeral, os que prefiren "software libre" adoitan ter unha postura máis filosófica ou moral sobre esta cuestión, mentres que os que prefiren "software de fontes abertas" non ven este tema como unha cuestión de liberdade, ou non están interesados en publicitar este punto de vista. Bótalle unha ollada a <xref linkend="free-vs-open-source"/><phrase output="printed"> en <xref linkend="introduction"/></phrase> para veres unha historia máis detallada sobre este cisma.

source: The Free Software Foundation has an excellent&mdash;utterly unobjective, but nuanced and quite fair&mdash;exegesis of the two terms, at <ulink url="http://www.fsf.org/licensing/essays/free-software-for-freedom.html"></ulink>. The Open Source Initiative's take on it is (or was, in 2002) spread across two pages: <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing"></ulink> and <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/free-notfree.php"></ulink>.
gl: A Free Software Foundation ten un excelente&mdash;carente de obxectividade, mais contodo matizada e moi xusta&mdash;exexese de ambos termos, en <ulink url="http://www.fsf.org/licensing/essays/free-software-for-freedom.html"></ulink>. A visión da Open Source Initiative a respecto disto (ou polo menos a que tiñan en 2002) móstrase en dúas páxinas: <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing"></ulink> e <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/free-notfree.php"></ulink>.

source: Where there are two of anything, there will soon be three, and that is exactly what is happening with terms for free software. The academic world, perhaps wanting precision and inclusiveness over elegance, seems to have settled on FOSS, or sometimes F/OSS, standing for "Free / Open Source Software". Another variant gaining momentum is FLOSS, which stands for "Free / Libre Open Source Software" (<foreignphrase>libre</foreignphrase> is familiar in many languages and does not suffer from the ambiguities of "free"; see <ulink url="http://en.wikipedia.org/wiki/FLOSS"></ulink> for more).
gl: Onde caben dous, caben tres, e isto é exactamente o que está a suceder cos termos que enuncian o software libre. O mundo académico, quizais buscando precisión e inclusión máis que elegancia, parece que se decidiu pola forma "FOSS", ou ás veces "F/OSS", co significado "Free / Open Source Software". Outra variante que está gañando adeptos é "FLOSS", que significa "Free / Libre Open Source Software" (<foreignphrase>libre</foreignphrase> é común en varios idiomas e non está suxeita ás ambigüidades de "free"; bótalle unha ollada a <ulink url="http://en.wikipedia.org/wiki/FLOSS"></ulink> para máis detalles).

source: All these terms mean essentially the same thing: software that can be modified and redistributed by everyone, sometimes&mdash;but not always&mdash;with the requirement that derivative works be freely redistributable under the same terms.
gl: Todos estes termos significan esencialmente o mesmo: software que pode ser modificado e redistribuído por calquera, algunhas veces&mdash;mais non sempre&mdash;coa condición de que os traballos derivados teñan que ser libremente redistribuíbles baixo as mesmas cláusulas.

source: DFSG-compliant
gl: Conforme coas DFSG

source: Compliant with the Debian Free Software Guidelines (<ulink url="http://www.debian.org/social_contract#guidelines"></ulink>). This is a widely-used test for whether a given license is truly open source (free, <foreignphrase>libre</foreignphrase>, etc.). The Debian Project's mission is to maintain an entirely free operating system, such that someone installing it need never doubt that she has the right to modify and redistribute any or all of the system. The Debian Free Software Guidelines are the requirements that a software package's license must meet in order to be included in Debian. Because the Debian Project spent a good deal of time thinking about how to construct such a test, the guidelines they came up with have proven very robust (see <ulink url="http://en.wikipedia.org/wiki/DFSG"></ulink>), and as far as I'm aware, no serious objection to them has been raised either by the Free Software Foundation or the Open Source Initiative. If you know that a given license is DFSG-compliant, you know that it guarantees all the important freedoms (such as forkability even against the original author's wishes) required to sustain the dynamics of an open source project. All of the licenses discussed in this chapter are DFSG-compliant.
gl: Conforme coas "Directrices de Software Libre de Debian" (<ulink url="http://www.debian.org/social_contract#guidelines"></ulink>). Esta é unha proba amplamente empregada para comprobar se unha licenza dada é realmente software libre (de fontes abertas, etc). A misión do Proxecto Debian é manter un sistema operativo completamente libre, de xeito que ninguén que o instale nunca teña dúbidas sobre se ten o dereito de modificar e redistribuír calquera parte do sistema, ou mesmo o sistema enteiro. As Directrices de Software Libre de Debian son os requisitos que a licenza dun paquete de software ten que cumprir para poder sen incluído en Debian. Debido a que o Proxecto Debian empregou unha morea de tempo en pensar como construír este test, as directrices que xurdiron demostraron ser moi robustas (véxase <ulink url="http://en.wikipedia.org/wiki/DFSG"></ulink>) e ata onde eu sei, non se fixo ningunha obxección seria ás mesmas nin dende a Free Software Foundation nin dende a Open Source Initiative. Se sabes que unha licenza dada é conforme ás DFSG, entón sabes que garante todas as liberdades importantes (tales como a posibilidade dun <foreignphrase>fork </foreignphrase> mesmo contra os desexos do autor orixinal) requiridas para soster as dinámicas dun proxecto software libre. Todas as licenzas tratadas neste capítulo son conformes coas DFSG.

source: OSI-approved
gl: Aprobadas pola OSI

source: Approved by the Open Source Initiative. This is another widely-used test of whether a license permits all the necessary freedoms. The OSI's definition of open source software is based on the Debian Free Software Guidelines, and any license that meets one definition almost always meets the other. There have been a few exceptions over the years, but only involving niche licenses and none of any relevance here. Unlike the Debian Project, the OSI maintains a list of all licenses it has ever approved, at <ulink url="http://www.opensource.org/licenses/"></ulink>, so that being "OSI-approved" is an unambiguous state: a license either is or isn't on the list.
gl: Aprobadas pola Open Source Initiative. Esta é outra proba amplamente empregada para saber se unha licenza permite todas as liberdades necesarias. A definición de software de fontes abertas da OSI está baseada nas Directrices de Software Libre de Debian, e calquera licenza que concorda con unha das definicións, case sempre concorda coa outra. Ten habido unhas poucas excepcións ao longo do tempo, mais eran só licenzas de nicho sen relevancia. Ao contrario que o proxecto Debian, a OSI mantén unha lista de todas as licenzas que aprobou, en <ulink url="http://www.opensource.org/licenses/"></ulink>, co cal ser "aprobada por OSI" é un estado non ambiguo: unha licenza ou está ou non está na lista.

source: The Free Software Foundation also maintains a list of licenses at <ulink url="http://www.fsf.org/licensing/licenses/license-list.html"></ulink>. The FSF categorizes licenses not only by whether they are free, but whether they are compatible with the GNU General Public License. GPL compatibility is an important topic, covered in <xref linkend="license-compatibility"/><phrase output="printed"> later in this chapter</phrase>.
gl: A Free Software Foundation tamén mantén unha lista de licenzas en <ulink url="http://www.fsf.org/licensing/licenses/license-list.html"></ulink>. A FSF clasifica as licenzas non só segundo sexan libres ou non, senón tamén segundo sexan compatibles coa GNU General Public License. A compatibilidade coa GPL é un asunto importante, cuberto en <xref linkend="license-compatibility"/><phrase output="printed"> máis adiante neste capítulo</phrase>.

source: <firstterm>proprietary</firstterm>, <firstterm>closed-source</firstterm>
gl: <firstterm>Proprietario</firstterm>, <firstterm>código pechado</firstterm>

source: The opposite of "free" or "open source." It means software distributed under traditional, royalty-based licensing terms, where users pay per copy, or under any other terms sufficiently restrictive to prevent open source dynamics from operating. Even software distributed at no charge can still be proprietary, if its license does not permit free redistribution and modification.
gl: O oposto de software libre ou de código aberto. Fai referencia a software distribuído baixo licenzas tradicionais baseadas en regalías, onde os usuarios pagan por copia, ou baixo outros termos suficientemente restritivos para evitar as dinámicas operativas do software libre. Mesmo software distribuído sen cargo pode ser propietario, no caso de que a súa licenza non permitir a libre redistribución e modificación.

source: Generally "proprietary" and "closed-source" are synonyms. However, "closed-source" additionally implies that the source code cannot even be seen. Since the source code cannot be seen with most proprietary software, this is normally a distinction without a difference. However, occasionally someone releases proprietary software under a license that allows others to view the source code. Confusingly, they sometimes call this "open source" or "nearly open source," etc., but that's misleading. The <emphasis>visibility</emphasis> of the source code is not the issue; the important question is what you're allowed to do with it. Thus, the difference between proprietary and closed-source is mostly irrelevant, and the two can be treated as synonyms.
gl: Xeralmente "propietario" e "código pechado" son sinónimos. Aínda así, "código pechado" implica adicionalmente que o código fonte non pode nin sequera ser visto. Dado que o código fonte non pode ser visto na maior parte do software propietario, normalmente é máis unha distinción que non unha diferenza. Porén, ocasionalmente alguén publica software propietario baixo unha licenza que lle permite os demais veren o código fonte. Confusamente, estes autores ás veces chámanlle "software de fontes abertas" ou "próximo ao software de código aberto", etc., mais isto é enganoso. A <emphasis>visibilidade</emphasis>do código fonte non é a cuestión; a cuestión importante é aquilo que tes permitido facer co código fonte. Así, a diferenza entre o software propietario e o de código pechado é en gran parte irrelevante, e ambos termos poden ser tratados como sinónimos.

source: Sometimes <firstterm>commercial</firstterm> is used as a synonym for "proprietary," but properly speaking, the two are not the same thing. Free software can be commercial software. After all, free software can be sold, as long as the buyers are not restricted from giving away copies themselves. It can be commercialized in other ways as well, for example by selling support, services, and certification. There are multimillion dollar companies built on free software today, so it is clearly neither inherently anti-commercial nor anti-corporate. On the other hand, it <emphasis>is</emphasis> anti-proprietary by its nature, and this is the key way in which it differs from traditional per-copy license models.
gl: Ás veces <firstterm>comercial</firstterm> é empregado como sinónimo de "propietario", mais falando con propiedade, non é o mesmo. O software libre pode ser software comercial. Despois de todo, o software libre pode ser vendido, se os compradores non tiveren restrinxida a distribución de copias. Ademais, tamén pode ser comercializado doutros xeitos como, por exemplo, mediante a venta de soporte, servizos e certificación. Hoxe en día hai empresas multimillonarias baseadas no software libre, polo que claramente non é nin anticomercial nin antiempresarial. Por outra banda, si que <emphasis>é </emphasis> antipropietario por natureza, e esta é a característica que o diferencia dos modelos tradicionais de licenza por copia.

source: public domain
gl: Dominio público

source: Having no copyright holder, meaning that there is no one who has the right to restrict copying of the work. Being in the public domain is not the same as having no author. Everything has an author, and even if a work's author or authors choose to put it in the public domain, that doesn't change the fact that they wrote it.
gl: Que non ten dereitos de autor, quere dicir, que non hai ninguén co dereito de restrinxir a copia do traballo. Estar no dominio público non é o mesmo que non ter autor. Todo ten un autor, e mesmo se o autor ou autores dun traballo escollen poñelo no dominio público, isto non muda o feito de que eles escribiron o traballo.

source: When a work is in the public domain, material from it can be incorporated into a copyrighted work, and thereafter <emphasis>that copy</emphasis> of the material is covered under the same copyright as the whole work. But this does not affect the availability of the original work, which remains in the public domain. Thus, releasing something into the public domain is technically one way to make it "free," according to the guidelines of most free software certifying organizations. However, there are usually good reasons to use a license instead of just releasing into the public domain: even with free software, certain restrictions can be useful, not only to the copyright holder but even to recipients as well, as the next section makes clear.
gl: Cando un traballo está no dominio público, o contido do mesmo pode incorporarse nun traballo con dereitos de autor (un traballo con copyright), e a continuación <emphasis>esa copia</emphasis> do contido está cuberta baixo os mesmos dereitos de autor que o traballo completo. Mais isto non lle afecta á dispoñibilidade do traballo orixinal, o cal segue estando no dominio público. Así, publicar algo no dominio público é tecnicamente o mesmo que que facelo "libre" de acordo coas directrices da maioría das organizacións de certificación do software libre. Porén, normalmente hai boas razóns para empregar unha licenza en troca de simplemente publicar no dominio público: mesmo co software libre, algunhas restricións concretas poden ser útiles, non unicamente para o posuidor dos dereitos de autor, senón tamén para os beneficiarios, como se clarifica na seguinte seccións.

source: copyleft
gl: Copyleft ("esquerdo de copia")

source: A license that uses copyright law to achieve a result opposite to traditional copyright. Depending on whom you ask, this means either licenses that permit the freedoms under discussion here, or, more narrowly, licenses that not only permit those freedoms but <emphasis>enforce</emphasis> them, by stipulating that the freedoms must travel with the work. The Free Software Foundation uses the second definition exclusively; elsewhere, it's a toss-up: a lot of people use the term the same way the FSF does, but others&mdash;including some who write for mainstream media&mdash;tend to use the first definition. It's not clear that everyone using the term is aware that there's a distinction to be made.
gl: Unha licenza que emprega as leis de cobertura dos dereitos de autor para alcanzar o resultado oposto ao resultado tradicional dos dereitos de autor. Dependendo a quen lle preguntes, quere dicir tanto licenzas que permiten as liberdades que estamos a narrar aquí, ou, máis estritamente, licenzas que non só permiten esas liberdades, senón que as <emphasis>impoñen</emphasis>, estipulando que as liberdades deben acompañar o traballo. A Free Software Foundation emprega exclusivamente a segunda definición; noutros lugares é un complemento: moita xente emprega o termo do mesmo xeito que a FSF, mais outra&mdash;incluíndo xente que escribe nos principais medios de comunicación&mdash;tende a empregar a primeira definición. Non está claro que toda a xente que emprega o termo é consciente de que hai unha distinción que debe ser feita.

source: The canonical example of the narrower, stricter definition is the GNU General Public License, which stipulates that any derivative works must also be licensed under the GPL; see <xref linkend="license-compatibility"/><phrase output="printed"> later in this chapter</phrase> for more.
gl: O exemplo clásico da definición máis estrita é a GNU General Public License, a cal estipula que calquera traballo derivado debe ser licenciado baixo a GPL; véxase <xref linkend="license-compatibility"/><phrase output="printed"> máis adiante neste capítulo</phrase> para máis detalles.

source: Aspects of Licenses
gl: Características das licenzas
